feaser/openblt/Target/Demo/ARMCM4_STM32F4_Nucleo_F429ZI_IAR/Prog/lib/uip/netdev.c
/************************************************************************************//**
* \file         Demo/ARMCM4_STM32F4_Nucleo_F429ZI_IAR/Prog/lib/uip/netdev.c
* \brief        uIP network device port source file.
* \ingroup      Prog_ARMCM4_STM32F4_Nucleo_F429ZI_IAR
* \internal
*----------------------------------------------------------------------------------------
*                          C O P Y R I G H T
*----------------------------------------------------------------------------------------
*   Copyright (c) 2001, Swedish Institute of Computer Science. All rights reserved.
*
*----------------------------------------------------------------------------------------
*                            L I C E N S E
*----------------------------------------------------------------------------------------
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions
* are met:
*
* 1. Redistributions of source code must retain the above copyright
*    notice, this list of conditions and the following disclaimer.
*
* 2. Redistributions in binary form must reproduce the above copyright
*    notice, this list of conditions and the following disclaimer in the
*    documentation and/or other materials provided with the distribution.
*
* 3. Neither the name of the Institute nor the names of its contributors
*    may be used to endorse or promote products derived from this software
*    without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE INSTITUTE AND CONTRIBUTORS ``AS IS'' AND
* ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED.  IN NO EVENT SHALL THE INSTITUTE OR CONTRIBUTORS BE LIABLE
* FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
* DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
* OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
* HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
* OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
* SUCH DAMAGE.
*
* Author: Adam Dunkels <adam@sics.se>
*
* This file is part of the uIP TCP/IP stack.
*
* \endinternal
****************************************************************************************/

/****************************************************************************************
* Include files
****************************************************************************************/
#include <string.h>                              /* String utils (memcpy)              */
#include "uip.h"                                 /* uIP TCP/IP stack                   */
#include "uip_arp.h"                             /* uIP address resolution protocol    */
#include "lan8742.h"                             /* LAN8742 PHY driver                 */
#include "stm32f4xx.h"                           /* STM32 CPU and HAL header           */


/****************************************************************************************
* Macro definitions
****************************************************************************************/
/* The MAC address for the network interface. */
#define NETDEV_DEFAULT_MACADDR0           (0x08)
#define NETDEV_DEFAULT_MACADDR1           (0x00)
#define NETDEV_DEFAULT_MACADDR2           (0x27)
#define NETDEV_DEFAULT_MACADDR3           (0x69)
#define NETDEV_DEFAULT_MACADDR4           (0x5B)
#define NETDEV_DEFAULT_MACADDR5           (0x45)

/* Timeout time for transmitting a packet. */
#define NETDEV_TX_PACKET_TIMEOUT_MS       (250U)


/****************************************************************************************
* Type definitions
****************************************************************************************/
/* Rx buffer type. The data element address and size must be 32 byte aligned on this
 * STM32. Note that the data element size must be passed to the ETH DMA in the init field
 * (heth.Init.RxBuffLen).
 */
typedef struct t_rx_buf
{
  /* Pointer to the next Rx buffer in single linked chain. */
  struct t_rx_buf * next;
  /* Number of data bytes in this chain link. */
  uint16_t length;
  /* Total number of data bytes in the entire chain. */
  uint16_t total_length;
  /* Data byte buffer for the bytes in this chain link. */
  uint8_t data[(UIP_CONF_BUFFER_SIZE + 31) & ~31] __ALIGNED(32);
} tRxBuf;

/* Tx buffer type. The data element address and size must be 32 byte aligned on this
 * STM32.
 */
typedef struct t_tx_buf
{
  /* Data byte buffer. */
  uint8_t data[(UIP_CONF_BUFFER_SIZE + 31) & ~31] __ALIGNED(32);
} tTxBuf;


/****************************************************************************************
* Global data declarations
****************************************************************************************/
/* Ethernet handle used by the HAL drivers. */
ETH_HandleTypeDef  heth;

/* Ethernet Rx DMA Descriptors. */
ETH_DMADescTypeDef DMARxDscrTab[ETH_RX_DESC_CNT];

/* Ethernet Tx DMA Descriptors. */
ETH_DMADescTypeDef DMATxDscrTab[ETH_TX_DESC_CNT];


/****************************************************************************************
* Function prototypes
****************************************************************************************/
/* Ethernet PHY I/O routines. */
static int32_t   ETH_PHY_IO_Init    (void);

static int32_t   ETH_PHY_IO_DeInit  (void);

static int32_t   ETH_PHY_IO_ReadReg (uint32_t   devAddr,
                                     uint32_t   regAddr,
                                     uint32_t * regValPtr);

static int32_t   ETH_PHY_IO_WriteReg(uint32_t   devAddr,
                                     uint32_t   regAddr,
                                     uint32_t   regVal);

