feaser/openblt/Target/Demo/ARMCM4_STM32F4_Nucleo_F429ZI_IAR/Prog/lib/uip/netdev.c
static int32_t   ETH_PHY_IO_GetTick (void);

/* Rx buffer management routines. */
static uint8_t * rxbuf_alloc        (void);

static void      rxbuf_free         (uint8_t  * rx_buf_data);

/* Tx buffer management routines. */
static uint8_t * txbuf_alloc        (void);

static void      txbuf_free         (uint8_t  * tx_buf_data);


/****************************************************************************************
* Local data declarations
****************************************************************************************/
/* MAC adress buffer. */
static struct uip_eth_addr macAddress;

/* LAN8742 PHY component object handle. */
static lan8742_Object_t    lan8742Object;

/* LAN8742 PHY context with I/O function pointers. */
static lan8742_IOCtx_t     lan8742IOCtx =
{
  ETH_PHY_IO_Init,
  ETH_PHY_IO_DeInit,
  ETH_PHY_IO_WriteReg,
  ETH_PHY_IO_ReadReg,
  ETH_PHY_IO_GetTick
};

/* Rx buffer pool. Must be greater than ETH_RX_DESC_CNT yet smaller than 32,
 * otherwise there are not enough rx buffer allocation status flags.
 */
static tRxBuf              rxBufs[ETH_RX_DESC_CNT * 2U];

/* Rx buffer allocation status flags. */
static uint32_t            rxBufAllocFlags = 0U;

/* Tx buffer pool. Ideally greater than 1 yet smaller than 32, otherwise there are not
 * enough tx buffer allocation status flags.
 */
static tTxBuf              txBufs[2U];

/* Rx buffer allocation status flags. */
static uint32_t            txBufAllocFlags = 0U;


/****************************************************************************************
*            N E T W O R K   D E V I C E   R O U T I N E S
****************************************************************************************/
/************************************************************************************//**
** \brief     Initializes the network device.
**
****************************************************************************************/
void netdev_init(void)
{
  int32_t              phyLinkState;
  uint32_t             duplex;
  uint32_t             speed;
  ETH_MACConfigTypeDef macConf = {0};

  /* Store the default MAC address. */
  macAddress.addr[0] = NETDEV_DEFAULT_MACADDR0;
  macAddress.addr[1] = NETDEV_DEFAULT_MACADDR1;
  macAddress.addr[2] = NETDEV_DEFAULT_MACADDR2;
  macAddress.addr[3] = NETDEV_DEFAULT_MACADDR3;
  macAddress.addr[4] = NETDEV_DEFAULT_MACADDR4;
  macAddress.addr[5] = NETDEV_DEFAULT_MACADDR5;

  /* Initialize Ethernet. */
  heth.Instance = ETH;
  heth.Init.MACAddr = &macAddress.addr[0];
  heth.Init.MediaInterface = HAL_ETH_RMII_MODE;
  heth.Init.TxDesc = DMATxDscrTab;
  heth.Init.RxDesc = DMARxDscrTab;
  heth.Init.RxBuffLen = (UIP_CONF_BUFFER_SIZE + 31) & ~31;
  (void)HAL_ETH_Init(&heth);

  /* Link the PHY I/O functions to the component object and initialize the PHY. */
  LAN8742_RegisterBusIO(&lan8742Object, &lan8742IOCtx);
  LAN8742_Init(&lan8742Object);

  /* Obtain the current link state from the PHY. */
  phyLinkState = LAN8742_GetLinkState(&lan8742Object);

  /* Filter on the state to retrieve the speed and half/full-duplex properties. */
  switch (phyLinkState)
  {
    case LAN8742_STATUS_100MBITS_FULLDUPLEX:
      duplex = ETH_FULLDUPLEX_MODE;
      speed = ETH_SPEED_100M;
      break;
    case LAN8742_STATUS_100MBITS_HALFDUPLEX:
      duplex = ETH_HALFDUPLEX_MODE;
      speed = ETH_SPEED_100M;
      break;
    case LAN8742_STATUS_10MBITS_FULLDUPLEX:
      duplex = ETH_FULLDUPLEX_MODE;
      speed = ETH_SPEED_10M;
      break;
    case LAN8742_STATUS_10MBITS_HALFDUPLEX:
      duplex = ETH_HALFDUPLEX_MODE;
      speed = ETH_SPEED_10M;
      break;
    default:
      duplex = ETH_FULLDUPLEX_MODE;
      speed = ETH_SPEED_100M;
      break;
  }

  /* Get and update the current MAC configuration. */
  HAL_ETH_GetMACConfig(&heth, &macConf);
  macConf.DuplexMode = duplex;
  macConf.Speed = speed;
  HAL_ETH_SetMACConfig(&heth, &macConf);

  /* Kick of the Ethernet packet communication in polling mode. */
  HAL_ETH_Start(&heth);
} /*** end of netdev_init ***/


/************************************************************************************//**
** \brief     Initializes the MAC address of the network device.
**
****************************************************************************************/
void netdev_init_mac(void)
{
  /* Configure the MAC address */
  uip_setethaddr(macAddress);
} /*** end of netdev_init_mac ***/


/************************************************************************************//**
** \brief     Obtains the MAC address of the network device.
** \param     mac_addr MAC address storage buffer as a byte array.
**
****************************************************************************************/
void netdev_get_mac(unsigned char * mac_addr)
{
  mac_addr[0] = macAddress.addr[0];
  mac_addr[1] = macAddress.addr[1];
  mac_addr[2] = macAddress.addr[2];
  mac_addr[3] = macAddress.addr[3];
  mac_addr[4] = macAddress.addr[4];
  mac_addr[5] = macAddress.addr[5];
} /*** end of netdev_get_mac ***/


/************************************************************************************//**
** \brief     Read newly received data from the network device.
** \details   Copy the newly received data to the uip_buf byte buffer. Keep in mind its
**            maximum size (UIP_CONF_BUFFER_SIZE).
** \return    Number of newly received bytes that were copied to uip_buf or 0 if no new
**            data was received.
**
****************************************************************************************/
unsigned int netdev_read(void)
{
  unsigned int   result = 0;
  tRxBuf       * rxBuf  = NULL;

  /* Check for newly receive data. Note this function triggers HAL_ETH_RxLinkCallback()
   * one or more times to build a chain link of tRxBufs. If new data was available,
   * the pointer to the first chain in the link is stored in rxBuf.
   */
  if (HAL_ETH_ReadData(&heth, (void **)&rxBuf) == HAL_OK)
  {
    /* Only continue with a valid buffer pointer, meaning that a chain link was built. */
    if (rxBuf != NULL)
    {
      /* Iterate over all the links in the chain. */
      for (tRxBuf * p = rxBuf; p != NULL; p = p->next)
      {
        /* Only copy the data for later processing if it actually fits in the uip_buf
         * and if the length and total length elements are valid.
         */
        if ((p->length > 0U) && (p->total_length > 0U) &&
            (p->length <= p->total_length) && (p->total_length <= UIP_CONF_BUFFER_SIZE))
        {
          /* Append the data from this chain link to the uIP data buffer. */
          memcpy(&uip_buf[result], p->data, p->length);
          /* Update the result. */
          result += p->length;
        }
        /* Release the allocated Rx buffer now that we're done with it. Keep in mind
         * that it's freed by specifying the address of its data pointer.
         */
        rxbuf_free(p->data);
      }
    }
  }
  /* Give the result back to the caller. */
  return result;
} /*** end of netdev_read ***/


/************************************************************************************//**
** \brief     Send data on the network device.
** \details   The data to set in available in the uip_buf byte buffer and the number of
**            bytes to send is stored in uip_len.
**
****************************************************************************************/
void netdev_send(void)
{
  ETH_TxPacketConfig   txPacketConfig = {0};
  ETH_BufferTypeDef    txBuffer       = {0};
  uint8_t            * txData;

  /* Allocate a new tx data buffer from the pool. */
  txData = txbuf_alloc();

  /* Only continue if the allocation succeeded. */
  if (txData != NULL)
  {
    /* Copy the packet data to the tx data buffer. */
    memcpy(txData, uip_buf, uip_len);

    /* Prepare the transmit buffer. This implementation assumes that a single ETH
     * transmit descriptor can handle the packet with a size up to UIP_CONF_BUFFER_SIZE.
     * Note that the STM32 Ethernet peripheral can handle up to 32k bytes per ETH
     * transmit descriptor.
     */
    txBuffer.buffer = txData;
    txBuffer.len    = uip_len;
    txBuffer.next   = NULL;

    /* Prepare transmit packet configuration. */
    txPacketConfig.Attributes   = ETH_TX_PACKETS_FEATURES_CSUM |
                                  ETH_TX_PACKETS_FEATURES_CRCPAD;
    txPacketConfig.ChecksumCtrl = ETH_CHECKSUM_IPHDR_PAYLOAD_INSERT_PHDR_CALC;
    txPacketConfig.CRCPadCtrl   = ETH_CRC_PAD_INSERT;
    txPacketConfig.Length       = uip_len;
    txPacketConfig.TxBuffer     = &txBuffer;
    txPacketConfig.pData        = txBuffer.buffer;

    /* Submit request to transmit the Ethernet Packet in polling mode. */
    HAL_ETH_Transmit(&heth, &txPacketConfig, NETDEV_TX_PACKET_TIMEOUT_MS);

    /* Release the previously allocated tx data buffer back to the pool. Keep in mind
     * that it's freed by specifying the address of its data pointer.
     */
    txbuf_free(txData);
  }
} /*** end of netdev_send ***/


/****************************************************************************************
*            R X   B U F F E R   M A N A G E M E N T   R O U T I N E S
****************************************************************************************/
/************************************************************************************//**
** \brief     Allocate a new Rx buffer from the pool.
** \return    Pointer to the allocated Rx buffer's data element if successful, NULL
**            otherwise.
**
****************************************************************************************/
static uint8_t * rxbuf_alloc(void)
{
  uint8_t *     result      = NULL;
  const uint8_t totalRxBufs = sizeof(rxBufs)/sizeof(rxBufs[0]);

  /* Find the next free buffer. */
  for (uint8_t rxBufIdx = 0; rxBufIdx < totalRxBufs; rxBufIdx++)
  {
    /* Is the buffer at this index available? */
    if ((rxBufAllocFlags & (1 << rxBufIdx)) == 0U)
    {
      /* Flag this one as allocated. */
      rxBufAllocFlags |= (1 << rxBufIdx);
      /* Update the result. */
      result = rxBufs[rxBufIdx].data;
      /* Stop the loop. */
      break;
    }
  }
  /* Give the result back to the caller. */
  return result;
} /*** end of rxbuf_alloc ***/


/************************************************************************************//**
** \brief     Releases a previously allocated Rx buffer and give it back to the pool.
** \param     rx_buf_data Pointer to the allocated Rx buffer's data element.
**
****************************************************************************************/
static void rxbuf_free(uint8_t * rx_buf_data)
{
  const uint8_t totalRxBufs = sizeof(rxBufs)/sizeof(rxBufs[0]);

  /* Find the index of the specified buffer in the pool. */
  for (uint8_t rxBufIdx = 0; rxBufIdx < totalRxBufs; rxBufIdx++)
  {
    /* Is this the one that should be released? */
    if (rxBufs[rxBufIdx].data == rx_buf_data)
    {
      /* Flag this one as free. */
      rxBufAllocFlags &= ~(1 << rxBufIdx);
      /* Stop the loop. */
      break;
    }
  }
} /*** end of rxbuf_free ***/


/****************************************************************************************
*            T X   B U F F E R   M A N A G E M E N T   R O U T I N E S
****************************************************************************************/
/************************************************************************************//**
** \brief     Allocate a new Tx buffer from the pool.
** \return    Pointer to the allocated Tx buffer's data element if successful, NULL
**            otherwise.
**
****************************************************************************************/
static uint8_t * txbuf_alloc(void)
{
  uint8_t *     result      = NULL;
  const uint8_t totalTxBufs = sizeof(txBufs)/sizeof(txBufs[0]);

  /* Find the next free buffer. */
  for (uint8_t txBufIdx = 0; txBufIdx < totalTxBufs; txBufIdx++)
  {
    /* Is the buffer at this index available? */
    if ((txBufAllocFlags & (1 << txBufIdx)) == 0U)
    {
      /* Flag this one as allocated. */
      txBufAllocFlags |= (1 << txBufIdx);
      /* Update the result. */
      result = txBufs[txBufIdx].data;
      /* Stop the loop. */
      break;
    }
  }
  /* Give the result back to the caller. */
  return result;
} /*** end of txbuf_alloc ***/


/************************************************************************************//**
** \brief     Releases a previously allocated Tx buffer and give it back to the pool.
** \param     tx_buf_data Pointer to the allocated Tx buffer's data element.
**
****************************************************************************************/
static void txbuf_free(uint8_t * tx_buf_data)
{
  const uint8_t totalTxBufs = sizeof(txBufs)/sizeof(txBufs[0]);

  /* Find the index of the specified buffer in the pool. */
  for (uint8_t txBufIdx = 0; txBufIdx < totalTxBufs; txBufIdx++)
  {
    /* Is this the one that should be released? */
    if (txBufs[txBufIdx].data == tx_buf_data)
    {
      /* Flag this one as free. */
      txBufAllocFlags &= ~(1 << txBufIdx);
      /* Stop the loop. */
      break;
    }
  }
} /*** end of txbuf_free ***/


/****************************************************************************************
*            H A L   C A L L B A C K   R O U T I N E S
****************************************************************************************/
/************************************************************************************//**
** \brief     Callback to allocate a packet reception buffer.
** \param     buff Pointer for storing the allocation results.
**
****************************************************************************************/
void HAL_ETH_RxAllocateCallback(uint8_t ** buff)
{
  /* Allocate a new Rx buffer from the pool. */
  *buff = rxbuf_alloc();
} /*** end of HAL_ETH_RxAllocateCallback ***/


/************************************************************************************//**
** \brief     Callback to process newly received data.
** \param     pStart pointer to packet start
** \param     pEnd pointer to packet end
** \param     buff pointer to received data
** \param     length received data length
**
****************************************************************************************/
void HAL_ETH_RxLinkCallback(void     ** pStart,
                            void     ** pEnd,
                            uint8_t  *  buff,
                            uint16_t    length)
{
  tRxBuf ** ppStart = (tRxBuf **)pStart;
  tRxBuf ** ppEnd   = (tRxBuf **)pEnd;
  tRxBuf *  p;

