feaser/openblt/Target/Demo/ARMCM4_STM32F4_Nucleo_F429ZI_IAR/Prog/lib/uip/netdev.c
  /* Get the tRxBuf pointer from the buff address. */
  p = (tRxBuf *)(buff - offsetof(tRxBuf, data));
  p->next = NULL;
  p->total_length = 0;
  p->length = length;

  /* Chain the buffer. */
  if (!*ppStart)
  {
    /* The first buffer of the packet. */
    *ppStart = p;
  }
  else
  {
    /* Chain the buffer to the end of the packet. */
    (*ppEnd)->next = p;
  }
  *ppEnd = p;

  /* Update the total length of all the buffers of the chain. Each link in the chain
   * should have its total_length set to its own length, plus the length of all the
   * following links in the chain.
   */
  for (p = *ppStart; p != NULL; p = p->next)
  {
    p->total_length += length;
  }
} /*** end of HAL_ETH_RxLinkCallback ***/


/****************************************************************************************
*            H A L   M S P   R O U T I N E S
****************************************************************************************/
/************************************************************************************//**
** \brief     ETH MSP Initialization.
** \details   This function configures the hardware resources used in this example.
** \param     heth ETH handle pointer.
**
****************************************************************************************/
void HAL_ETH_MspInit(ETH_HandleTypeDef* heth)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  if(heth->Instance==ETH)
  {
    /* Peripheral clock enable */
    __HAL_RCC_ETH_CLK_ENABLE();

    __HAL_RCC_GPIOC_CLK_ENABLE();
    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_GPIOG_CLK_ENABLE();
    /**ETH GPIO Configuration
    PC1     ------> ETH_MDC
    PA1     ------> ETH_REF_CLK
    PA2     ------> ETH_MDIO
    PA7     ------> ETH_CRS_DV
    PC4     ------> ETH_RXD0
    PC5     ------> ETH_RXD1
    PB13     ------> ETH_TXD1
    PG11     ------> ETH_TX_EN
    PG13     ------> ETH_TXD0
    */
    GPIO_InitStruct.Pin = GPIO_PIN_1|GPIO_PIN_4|GPIO_PIN_5;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF11_ETH;
    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = GPIO_PIN_1|GPIO_PIN_2|GPIO_PIN_7;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF11_ETH;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = GPIO_PIN_13;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF11_ETH;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = GPIO_PIN_11|GPIO_PIN_13;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF11_ETH;
    HAL_GPIO_Init(GPIOG, &GPIO_InitStruct);
  }
} /*** end of HAL_ETH_MspInit ***/


/************************************************************************************//**
** \brief     ETH MSP De-Initialization.
** \details   This function freeze the hardware resources used in this example.
** \param     heth ETH handle pointer.
**
****************************************************************************************/
void HAL_ETH_MspDeInit(ETH_HandleTypeDef* heth)
{
  if(heth->Instance==ETH)
  {
    /* Peripheral clock disable */
    __HAL_RCC_ETH_CLK_DISABLE();
    /* Reset Ethernet GPIO pin configuration. */
    HAL_GPIO_DeInit(GPIOC, GPIO_PIN_1|GPIO_PIN_4|GPIO_PIN_5);
    HAL_GPIO_DeInit(GPIOA, GPIO_PIN_1|GPIO_PIN_2|GPIO_PIN_7);
    HAL_GPIO_DeInit(GPIOB, GPIO_PIN_13);
    HAL_GPIO_DeInit(GPIOG, GPIO_PIN_11|GPIO_PIN_13);
  }
} /*** end of HAL_ETH_MspDeInit ***/


/****************************************************************************************
*            E T H E R N E T   P H Y   I / O   R O U T I N E S
****************************************************************************************/
/************************************************************************************//**
** \brief     Initializes the MDIO interface GPIO and clocks.
** \details   This function assumes that the MDIO GPIO configuration is already done.
** \return    0 if successful, -1 otherwise.
**
****************************************************************************************/
static int32_t ETH_PHY_IO_Init(void)
{
  /* Configure the MDIO Clock. */
  HAL_ETH_SetMDIOClockRange(&heth);
  return 0;
} /*** end of ETH_PHY_IO_Init ***/


/************************************************************************************//**
** \brief     De-Initializes the MDIO interface.
** \return    0 if successful, -1 otherwise.
**
****************************************************************************************/
static int32_t ETH_PHY_IO_DeInit(void)
{
  /* Nothing to do for this specific PHY. */
  return 0;
} /*** end of ETH_PHY_IO_DeInit ***/


/************************************************************************************//**
** \brief     Read a PHY register through the MDIO interface.
** \param     devAddr PHY port address
** \param     regAddr PHY register address
** \param     regValPtr Pointer to hold the register value.
** \return    0 if successful, -1 otherwise.
**
****************************************************************************************/
static int32_t ETH_PHY_IO_ReadReg(uint32_t   devAddr,
                                  uint32_t   regAddr,
                                  uint32_t * regValPtr)
{
  int32_t result = 0;

  if (HAL_ETH_ReadPHYRegister(&heth, devAddr, regAddr, regValPtr) != HAL_OK)
  {
    result = -1;
  }
  /* Give the result back to the caller. */
  return result;
} /*** end of ETH_PHY_IO_ReadReg ***/


/************************************************************************************//**
** \brief     Write a value to a PHY register through the MDIO interface.
** \param     devAddr PHY port address
** \param     regAddr PHY register address
** \param     regVal Value to be written.
** \return    0 if successful, -1 otherwise.
**
****************************************************************************************/
static int32_t ETH_PHY_IO_WriteReg(uint32_t devAddr,
                                   uint32_t regAddr,
                                   uint32_t regVal)
{
  int32_t result = 0;

  if (HAL_ETH_WritePHYRegister(&heth, devAddr, regAddr, regVal) != HAL_OK)
  {
    result = -1;
  }
  /* Give the result back to the caller. */
  return result;
} /*** end of ETH_PHY_IO_WriteReg ***/


/************************************************************************************//**
** \brief     Get the time in milliseconds used for internal PHY driver process.
** \return    Current system time in milliseconds.
**
****************************************************************************************/
static int32_t ETH_PHY_IO_GetTick(void)
{
  return HAL_GetTick();
} /*** end of ETH_PHY_IO_GetTick ***/


/*********************************** end of netdev.c ***********************************/
